HEATMAP

In [1]:
import seaborn as sns

flights = sns.load_dataset('flights')
df = flights.copy()
df.head()

   year month  passengers
0  1949   Jan         112
1  1949   Feb         118
2  1949   Mar         132
3  1949   Apr         129
4  1949   May         121

In [2]:
df.shape

(144, 3)

In [3]:
df['passengers'].describe()

count    144.000000
mean     280.298611
std      119.966317
min      104.000000
25%      180.000000
50%      265.500000
75%      360.500000
max      622.000000
Name: passengers, dtype: float64

In [ ]:
df = df.pivot('month', 'year', 'passengers');

TypeError: DataFrame.pivot() takes 1 positional argument but 4 were given